In [6]:
print("hello")

hello

<br>
<br>

### What do you mean by third party libraries?

Libraries which are not available internally and we have to install it using pip. Eg-> Numpy, Pandas, Matplotlib, sklearn. <br>
Numpy is not inbuilt library of python i.e third party library which u have to install with pip command (pip install numpy)

### Difference between Numpy Pandas and Matplotlib?

NUMPY -> Numpy stands for numerical python library. It is a fundamental pyhon library complex numerical operations will be done by numpy.
Numpy is open source library.

PANDAS -> Pandas third vendor library is used for processing the data in the form of well structured form or represent the data in the form of tables.

MATPLOTLIB -> Matplotlib library is used for creating/plotting the graphs.

### In which lang numpy is written?

Python and C

<br>
<br>

<h3> Creating Diagnol Matrix</h3>

In [10]:
np.eye(3,3,dtype='int32')

array([[1, 0, 0],
       [0, 1, 0],
       [0, 0, 1]])

<h3>Creating Identity Matrix </h3>

In [21]:
np.identity(3,dtype='int32')

array([[1, 0, 0],
       [0, 1, 0],
       [0, 0, 1]])

<h3>Creating Zero Matrix </h3>

In [30]:
np.zeros((3,3),dtype='int32')

array([[0, 0, 0],
       [0, 0, 0],
       [0, 0, 0]])

<h3>Unit Matrix</h3>

In [23]:
np.ones([3,3],dtype='int32')

array([[1, 1, 1],
       [1, 1, 1],
       [1, 1, 1]])

<h3>Convert list into an array</h3>

In [2]:
import numpy as np

list = [1,2,3,4]

#np.array() converts list into array

arr = np.array(list)
print(arr)

print(type(arr))

[1 2 3 4]
<class 'numpy.ndarray'>

<h3>Checking dimensions of different array</h3>

In [5]:
a = np.array(42)
b = np.array([1, 2, 3, 4, 5])
c = np.array([[1, 2, 3], [4, 5, 6]])
d = np.array([[[1, 2, 3], [4, 5, 6]], [[1, 2, 3], [4, 5, 6]]])

print(a.ndim)
print(b.ndim)
print(c.ndim)
print(d.ndim)

0
1
2
3

In [10]:
t=[]
for i in range(5):
    x=int(input())
    t.append(x)
print(t)
print(type(t))

arr1 = np.array(t)
print(arr1)
print(type(arr1))

10
20
30
40
50
[10, 20, 30, 40, 50]
<class 'list'>
[10 20 30 40 50]
<class 'numpy.ndarray'>

<h3>2D Array</h3>

In [16]:
list1 = [1,2,3]
list2 = [4,5,6]
arr2 = np.array([list1,list2])
print(arr2)
print(arr2[0][-1])

[[1 2 3]
 [4 5 6]]
3

<h3>Array Having 5 dimensions</h3>

In [17]:
arr3 = np.array([1,2,3,4,5], ndmin =5)
print(arr3)
print(arr3.ndim)

[[[[[1 2 3 4 5]]]]]
5

<h3>Checking datatype of an array</h3>

Below is a list of all data types in NumPy and the characters used to represent them.
<br>
i - integer<br>
b - boolean<br>
u - unsigned integer<br>
f - float<br>
c - complex float<br>
m - timedelta<br>
M - datetime<br>
O - object<br>
S - string<br>
U - unicode string<br>
V - fixed chunk of memory for other type ( void )<br>

In [18]:
arr = np.array([1, 2, 3, 4])
print(arr.dtype)

int32

In [20]:
import numpy as np
arr = np.array(['apple', 'banana', 'cherry'])
print(arr.dtype)

<U6

In [21]:
import numpy as np
arr = np.array([1, 2, 3, 4], dtype='S')
print(arr)
print(arr.dtype)

[b'1' b'2' b'3' b'4']
|S1

In [7]:
arr=np.array([1,2,3])
print(arr*2)
print(arr+2)
print(arr-2)
print(arr/2)

[2 4 6]
[3 4 5]
[-1  0  1]
[0.5 1.  1.5]

In [27]:
list1=[1,2,3]
list2=[3,4,5]
sum=0
for i in range(3):
    sum=sum+list1[i]*list2[i]
print(sum)

26

In [46]:
list1=[1,2,3]
list2=[3,4,5]
for i in range(3):
    print(list1[i], list2[i])

1 3
2 4
3 5

### Zip Method (For tuples pairing)

In [49]:
a=zip(list1,list2)
print(tuple(a))

<zip object at 0x000001E0253DF400>
((1, 3), (2, 4), (3, 5))

# Linear Algebra Function
Operators	Descriptions<br>
dot()	calculates product of two arrays<br>
inner()	calculates inner product of arrays<br>
outer()	calculates outer product of arrays<br>
det()	calculates determinant of a matrix<br>
solve()	solves linear matrix equation<br>
inv()	calculates the multiplicative inverse of the matrix<br>
trace()	calculates the sum of diagonal elements<br>

## dot() Function
We can use the dot() function available in NumPy's linear algebra module to calculate the product of two arrays.

In [17]:
import numpy as np

array1 = np.array([1, 3, 5])
array2 = np.array([2, 4, 6])

# use of dot() to perform array multiplication
result = np.dot(array1, array2)

print(result)

44

In this example, the dot(array1, array2) function computes the dot product of array1 and array2, which is equal to 1X2 + 3X4 + 5X6 = 44.

## inner() Function
In NumPy, the inner() function computes the inner product of two arrays, which is the sum of the products of their corresponding entries.

In [18]:
import numpy as np

array1 = np.array([[1, 3], 
                   [5, 7]])
array2 = np.array([[2, 4], 
                   [6, 8]])

# inner() for 2D arrays
result = np.inner(array1, array2)

print(result)

[[14 30]
 [38 86]]

n the above example, inner() first flattens 2D arrays to 1D arrays and then computes the inner product of those flattened arrays.

The resulting 2x2 matrix is the reshaped version of the flattened result.

Here, the inner product is calculated as:

1X2+3X4        1X6+3X8
5X2+7X4        5X6+7X8
Note: For 1D arrays, inner() is equivalent to dot().

## outer() function
The outer() function in NumPy computes the outer product of two arrays, which is the product of all possible pairs of their entries.

In [19]:
import numpy as np

array1 = np.array([1, 3, 5])
array2 = np.array([2, 4, 6])

# outer() to perform outer multiplication
result = np.outer(array1, array2)

print(result)

[[ 2  4  6]
 [ 6 12 18]
 [10 20 30]]

Here, the outer product is calculated as:

1*2       1*4       1*6        
3*2      3*4       3*6
5*2      5*4       5*6

## det() Function
In NumPy, we use the det() function from the NumPy linalg module to calculate the determinant of a square matrix.

In [20]:
import numpy as np

# define a square matrix
array1 = np.array([[1, 3], 
                  [5, 7]])

# compute the determinant of array1
result = np.linalg.det(array1)


print(result)

-7.999999999999998

Here, we have used the det() function from the linalg module to
 calculate the determinant of the square matrix named array1.

## solve() Function
In NumPy, we use the solve() function to solve a system of linear equations.

For a given matrix A and a vector b, solve(A, b) finds the solution vector x that satisfies the equation Ax = b.

In [21]:
import numpy as np

# define the coefficient matrix A
A = np.array([[2, 4], 
             [6, 8]])

# define the constant vector b
b = np.array([5, 6])

# solve the system of linear equations Ax = b
x = np.linalg.solve(A, b)

print(x)

[-2.    2.25]

In this example, we have used the solve() function from the linalg module to solve the system of linear equations.

Here, the output is [-2. 2.25], which is the solution to the system of linear equations 2x + 4y = 5 and 6x + 8y = 6.

Note: The solve() function only works for square matrices, and it assumes that the matrix A has a non-zero determinant, 
else solve() will raise a LinAlgError exception.

## inv() Function
We use the inv() function from the linalg module in NumPy to find the inverse of a square matrix.

In [22]:
import numpy as np

# define a 2x2 matrix
array1 = np.array([[2, 4], 
                  [6, 8]])

# compute the inverse of the matrix
result = np.linalg.inv(array1)

print(result)

[[-1.    0.5 ]
 [ 0.75 -0.25]]

Here, we have used the linalg.inv() function to calculate the inverse of the array1 matrix.

## trace() Function
In NumPy, we use the trace() function to compute the sum of the diagonal elements of a matrix.

In [23]:
import numpy as np

# define a 3x3 matrix
array1 = np.array([[6, 3, 5], 
                   [9, 2, 1], 
                   [7, 8, 4]])

# compute the trace of the matrix
result = np.trace(array1)

print(result)

12

In this example, the diagonal elements of the matrix are 6, 2, and 4, so the sum of these elements is 12. So, 
the trace() function returns this value as the output

## Compute Median for Odd Number of Elements in 1d array

In [25]:
#create a 1D array with 5 elements
array1 = np.array([1, 2, 3, 4, 5])
                                                                                                           
# calculate the median
median = np.median(array1)

print(median)

3.0

## Compute the median of a 2D array

In [26]:
import numpy as np

# create a 2D array
array1 = np.array([[2, 4, 6], 
                   [8, 10, 12], 
                   [14, 16, 18]])

# compute median along horizontal axis 
result1 = np.median(array1, axis=1)

print("Median along horizontal axis :", result1)

# compute median along vertical axis
result2 = np.median(array1, axis=0)

print("Median along vertical axis:", result2)

# compute median of entire array
result3 = np.median(array1)

print("Median of entire array:", result3)

Median along horizontal axis : [ 4. 10. 16.]
Median along vertical axis: [ 8. 10. 12.]
Median of entire array: 10.0

## Mean of 1d array

In [27]:
import numpy as np

# create a numpy array
marks = np.array([76, 78, 81, 66, 85])

# compute the mean of marks
mean_marks = np.mean(marks)

print(mean_marks)

77.2

## Mean of NumPy 2d Array

In [31]:
import numpy as np

# create a 2D array
array1 = np.array([[1, 3], 
                 [5, 7]])

# calculate the mean of the entire array
result1 = np.mean(array1)
print("Entire Array:",result1)

# calculate the mean along vertical axis (axis=0)
result2 = np.mean(array1, axis=0)
print("Along Vertical Axis:",result2)

# calculate the mean along horizontal axis (axis=1)
result3 = np.mean(array1, axis=1)
print("Along Horizontal Axis :",result3)

Entire Array: 4.0
Along Vertical Axis: [3. 5.]
Along Horizontal Axis : [2. 6.]

## Standard Deviation of 1-d array

In [32]:
#1d array
import numpy as np

# create a numpy array
marks = np.array([76, 78, 81, 66, 85])

# compute the standard deviation of marks
std_marks = np.std(marks)
print(std_marks)

6.368673331236263

## Standard Deviation of a 2D array

In [33]:
import numpy as np

# create a 2D array
array1 = np.array([[2, 5, 9], 
                 [3, 8, 11], 
                 [4, 6, 7]])

# compute standard deviation along horizontal axis
result1 = np.std(array1, axis=1)
print("Standard deviation along horizontal axis:", result1)

# compute standard deviation along vertical axis
result2 = np.std(array1, axis=0)
print("Standard deviation  along vertical axis:", result2)

# compute standard deviation of entire array
result3 = np.std(array1)
print("Standard deviation of entire array:", result3)

Standard deviation along horizontal axis: [2.86744176 3.29983165 1.24721913]
Standard deviation  along vertical axis: [0.81649658 1.24721913 1.63299316]
Standard deviation of entire array: 2.7666443551086073

## Percentile of NumPy Array
In NumPy, we use the percentile() function to compute the nth percentile of a given array.

In [34]:
import numpy as np

# create an array
array1 = np.array([1, 3, 5, 7, 9, 11, 13, 15, 17, 19])

# compute the 25th percentile of the array
result1 = np.percentile(array1, 25)
print("25th percentile:",result1)

# compute the 75th percentile of the array
result2 = np.percentile(array1, 75)
print("75th percentile:",result2)

25th percentile: 5.5
75th percentile: 14.5

## Find Minimum and Maximum Value of NumPy Array
We use the min() and max() function in NumPy to find the minimum and maximum values in a given array.

In [35]:
import numpy as np

# create an array
array1 = np.array([2,6,9,15,17,22,65,1,62])

# find the minimum value of the array
min_val = np.min(array1)

# find the maximum value of the array
max_val = np.max(array1)

# print the results
print("Minimum value:", min_val)
print("Maximum value:", max_val)

Minimum value: 1
Maximum value: 65

# PANDAS

Pandas is an open source data analysis  in python<br>
2 types of data structures in pandas-><br>
1.) SERIES ---> 1D with single row or column<br>
2.) DATAFRAMES ---> 2D tabular representation containing rows nd columns<br>

In [1]:
import pandas as pd
thisdict = {
    "brand" : "Fords",
    "model": "mustang",
    "year": 1964
}
print(thisdict["model"])

mustang

In [6]:
import pandas as pd
dict={
    93:"Afganistan",
    355:"Albania",
    672:"Antartica",
    54:"Argentina",
    61:"Australia",
    43:"Austria",
    880:"Bangladesh",
    32:"Belgium",
    975:"Bhutan",
    55:"Brazil",
    1:"Canada",
    86:"China",
    679:"Fuji",
    358:"Finland",
    33:"France",
    995:"Georgia",
    49:"Germany",
    30:"Greece",
    299:"Greenland",
    852:"Hong Kong",
    36:"Hungary",
    354:"Iceland",
    91:"India"
}
cn=int(input())
print(dict[cn])

1
Canada

### Dictionary
We have list ,arrays and dictionary are objects in python. Arrays and List internally using array and double linked list data structure but in case of dictionary in python, dictionary internally use map data structure. Map works on key value pairs. If i want to retrieve the elements from array and list, we need index value. On the behalf of indexing we are inserting, deleting, updating elements in array and list but in case of dict we retrieve the data on behalf of key.If i want to retrieve elements, delete ,insert or modify elements in dict/map, we need key. In map/dict key will never be a duplicate but values can be duplicate. In real time applications we are retrieving the elements from the dropdown. For ex-> Country Code dropdown<br>
We specially recommended such type of task to map/dict data structure.

Give a written assignment on map data structures<br>
Define all the diagram representing the map algorithm and data structure<br>
What is the role of hash table in map concept<br>

# DATAFRAME

In [18]:
import pandas as pd
dict1={
    "name":['harry','ramesh','sita','rohan'],
    "location":['punjab','chandigarh','bihar','mumbai'],
    "marks":[96,94,96,98]
}
print(dict1)
df1 = pd.DataFrame(dict1)
df1

{'name': ['harry', 'ramesh', 'sita', 'rohan'], 'location': ['punjab', 'chandigarh', 'bihar', 'mumbai'], 'marks': [96, 94, 96, 98]}

     name    location  marks
0   harry      punjab     96
1  ramesh  chandigarh     94
2    sita       bihar     96
3   rohan      mumbai     98

In [19]:
print(df1.iloc[0,0])        #Integer based Indexing
print(df1.loc[0]['name'])    #Label based Indexing

harry
harry

## From csv file to dataframe

In [6]:
df = pd.read_csv(r'C:\Users\Saanvi Gupta\Desktop\NumpyProjects\test.csv')
df

,first_name,last_name,company_name,address,city,county,state,zip,phone1,phone2,email,web
0,James,Butt,"Benton, John B Jr",6649 N Blue Gum St,New Orleans,Orleans,LA,70116,504-621-8927,504-845-1427,jbutt@gmail.com,http://www.bentonjohnbjr.com
1,Josephine,Darakjy,"Chanay, Jeffrey A Esq",4 B Blue Ridge Blvd,Brighton,Livingston,MI,48116,810-292-9388,810-374-9840,josephine_darakjy@darakjy.org,http://www.chanayjeffreyaesq.com
2,Art,Venere,"Chemel, James L Cpa",8 W Cerritos Ave #54,Bridgeport,Gloucester,NJ,8014,856-636-8749,856-264-4130,art@venere.org,http://www.chemeljameslcpa.com
3,Lenna,Paprocki,Feltz Printing Service,639 Main St,Anchorage,Anchorage,AK,99501,907-385-4412,907-921-2010,lpaprocki@hotmail.com,http://www.feltzprintingservice.com
4,Donette,Foller,Printing Dimensions,34 Center St,Hamilton,Butler,OH,45011,513-570-1893,513-549-4561,donette.foller@cox.net,http://www.printingdimensions.com
...,...,...,...,...,...,...,...,...,...,...,...,...
495,Brittni,Gillaspie,Inner Label,67 Rv Cent,Boise,Ada,ID,83709,208-709-1235,208-206-9848,bgillaspie@gillaspie.com,http://www.innerlabel.com
496,Raylene,Kampa,Hermar Inc,2 Sw Nyberg Rd,Elkhart,Elkhart,IN,46514,574-499-1454,574-330-1884,rkampa@kampa.org,http://www.hermarinc.com
497,Flo,Bookamer,Simonton Howe & Schneider Pc,89992 E 15th St,Alliance,Box Butte,NE,69301,308-726-2182,308-250-6987,flo.bookamer@cox.net,http://www.simontonhoweschneiderpc.com
498,Jani,Biddy,Warehouse Office & Paper Prod,61556 W 20th Ave,Seattle,King,WA,98104,206-711-6498,206-395-6284,jbiddy@yahoo.com,http://www.warehouseofficepaperprod.com
499,Chauncey,Motley,Affiliated With Travelodge,63 E Aurora Dr,Orlando,Orange,FL,32804,407-413-4842,407-557-8857,chauncey_motley@aol.com,http://www.affiliatedwithtravelodge.com

## Dataframe to csv

In [7]:
df.to_csv('friends.csv',index=False)

In [8]:
df.describe()

               zip
count    500.00000
mean   47496.45200
std    32868.81793
min     1581.00000
25%    16501.75000
50%    44139.00000
75%    79971.25000
max    99712.00000

In [9]:
df.head()

,first_name,last_name,company_name,address,city,county,state,zip,phone1,phone2,email,web
0,James,Butt,"Benton, John B Jr",6649 N Blue Gum St,New Orleans,Orleans,LA,70116,504-621-8927,504-845-1427,jbutt@gmail.com,http://www.bentonjohnbjr.com
1,Josephine,Darakjy,"Chanay, Jeffrey A Esq",4 B Blue Ridge Blvd,Brighton,Livingston,MI,48116,810-292-9388,810-374-9840,josephine_darakjy@darakjy.org,http://www.chanayjeffreyaesq.com
2,Art,Venere,"Chemel, James L Cpa",8 W Cerritos Ave #54,Bridgeport,Gloucester,NJ,8014,856-636-8749,856-264-4130,art@venere.org,http://www.chemeljameslcpa.com
3,Lenna,Paprocki,Feltz Printing Service,639 Main St,Anchorage,Anchorage,AK,99501,907-385-4412,907-921-2010,lpaprocki@hotmail.com,http://www.feltzprintingservice.com
4,Donette,Foller,Printing Dimensions,34 Center St,Hamilton,Butler,OH,45011,513-570-1893,513-549-4561,donette.foller@cox.net,http://www.printingdimensions.com

In [10]:
df.tail()

,first_name,last_name,company_name,address,city,county,state,zip,phone1,phone2,email,web
495,Brittni,Gillaspie,Inner Label,67 Rv Cent,Boise,Ada,ID,83709,208-709-1235,208-206-9848,bgillaspie@gillaspie.com,http://www.innerlabel.com
496,Raylene,Kampa,Hermar Inc,2 Sw Nyberg Rd,Elkhart,Elkhart,IN,46514,574-499-1454,574-330-1884,rkampa@kampa.org,http://www.hermarinc.com
497,Flo,Bookamer,Simonton Howe & Schneider Pc,89992 E 15th St,Alliance,Box Butte,NE,69301,308-726-2182,308-250-6987,flo.bookamer@cox.net,http://www.simontonhoweschneiderpc.com
498,Jani,Biddy,Warehouse Office & Paper Prod,61556 W 20th Ave,Seattle,King,WA,98104,206-711-6498,206-395-6284,jbiddy@yahoo.com,http://www.warehouseofficepaperprod.com
499,Chauncey,Motley,Affiliated With Travelodge,63 E Aurora Dr,Orlando,Orange,FL,32804,407-413-4842,407-557-8857,chauncey_motley@aol.com,http://www.affiliatedwithtravelodge.com

In [11]:
df.tail(3)

,first_name,last_name,company_name,address,city,county,state,zip,phone1,phone2,email,web
497,Flo,Bookamer,Simonton Howe & Schneider Pc,89992 E 15th St,Alliance,Box Butte,NE,69301,308-726-2182,308-250-6987,flo.bookamer@cox.net,http://www.simontonhoweschneiderpc.com
498,Jani,Biddy,Warehouse Office & Paper Prod,61556 W 20th Ave,Seattle,King,WA,98104,206-711-6498,206-395-6284,jbiddy@yahoo.com,http://www.warehouseofficepaperprod.com
499,Chauncey,Motley,Affiliated With Travelodge,63 E Aurora Dr,Orlando,Orange,FL,32804,407-413-4842,407-557-8857,chauncey_motley@aol.com,http://www.affiliatedwithtravelodge.com

# SERIES

In [2]:
import pandas as pd
dict={'Names':['Ram','Rohit','Suresh','Ramesh','Mohit','Sonali','Reena','Soniya'],
     'Marks':[56,57,58,59,60,61,62,63],
     'Gender':['male','male','male','male','male','female','female','female']}
df1=pd.DataFrame(dict)
df1

    Names  Marks  Gender
0     Ram     56    male
1   Rohit     57    male
2  Suresh     58    male
3  Ramesh     59    male
4   Mohit     60    male
5  Sonali     61  female
6   Reena     62  female
7  Soniya     63  female

### First 3 rows of dataframe

In [3]:
df1.head(3)

    Names  Marks Gender
0     Ram     56   male
1   Rohit     57   male
2  Suresh     58   male

### Last 3 rows of dataframe

In [4]:
df1.tail(3)

    Names  Marks  Gender
5  Sonali     61  female
6   Reena     62  female
7  Soniya     63  female

## Sector vs Index
Sector is a column and indexing is every row has a unique index(number/char).
Sector is known as 1 object also index is an object of a dataframe.

Pandas is a library of python. Within pandas Dataframe is an object. Head and tails are methods.

## Shape of dataset (Rows and Columns)

In [7]:
print(df1.shape)
print("No. of Rows: ",df1.shape[0])
print("No. of Cols: ",df1.shape[1])

(8, 3)
No. of Rows:  8
No. of Cols:  3

## Get information about our dataset like total number of rows,cols,datatypes of each col, memory required.

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   8 non-null      object
 1   Marks   8 non-null      int64
 2   Gender  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

## Check null values in the dataset

In [9]:
df1.isnull()

   Names  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False
7  False  False   False

In [14]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
dtype: int64

## Get overall statistics about dataframe

In [17]:
df1.describe()     #only integer columns 
df1.describe(include='all')    #all columns whether numeric or alpha

       Names     Marks Gender
count      8   8.00000      8
unique     8       NaN      2
top      Ram       NaN   male
freq       1       NaN      5
mean     NaN  59.50000    NaN
std      NaN   2.44949    NaN
min      NaN  56.00000    NaN
25%      NaN  57.75000    NaN
50%      NaN  59.50000    NaN
75%      NaN  61.25000    NaN
max      NaN  63.00000    NaN

## Find unique values from gender column

In [20]:
df1['Gender'].unique()

array(['male', 'female'], dtype=object)

## Find no. of unique values from the gender column

In [24]:
df1['Gender'].nunique()

2

## Display count of unique values

In [25]:
df1['Gender'].value_counts()

male      5
female    3
Name: Gender, dtype: int64

## Find total no of students having marks between 90 to 100 (inclusive) using between method

In [33]:
df1[df1['Marks']>60]
df1[(df1['Marks']>=50) & (df1['Marks']<=60)]

df1[df1['Marks'].between(50,60)]

    Names  Marks Gender
0     Ram     56   male
1   Rohit     57   male
2  Suresh     58   male
3  Ramesh     59   male
4   Mohit     60   male

## Max, Min, Sum, Mean of a column in dataframe

In [34]:
df1['Marks'].max()

63

In [35]:
df1['Marks'].min()

56

In [36]:
df1['Marks'].sum()

476

In [37]:
df1['Marks'].mean()

59.5

## Apply Method

In [39]:
def marks(x):
    return x/2

#New column half marks using apply method (user defined function)

df1['Half Marks']=df1['Marks'].apply(marks)
df1

    Names  Marks  Gender  Half Marks
0     Ram     56    male        28.0
1   Rohit     57    male        28.5
2  Suresh     58    male        29.0
3  Ramesh     59    male        29.5
4   Mohit     60    male        30.0
5  Sonali     61  female        30.5
6   Reena     62  female        31.0
7  Soniya     63  female        31.5

## Lambda function

In [40]:
df1['Marks'].apply(lambda x: x/2)

0    28.0
1    28.5
2    29.0
3    29.5
4    30.0
5    30.5
6    31.0
7    31.5
Name: Marks, dtype: float64

## Map Function

map() function returns a map object(which is an iterator) of the results after applying the given function to each item of a given iterable (list, tuple etc.)

In [44]:
df1['Names'].apply(len)

#Convert male=1 female=0
df1['male_female']=df1['Gender'].map({'male':1, 'female':0})
df1

    Names  Marks  Gender  Half Marks  male_female
0     Ram     56    male        28.0            1
1   Rohit     57    male        28.5            1
2  Suresh     58    male        29.0            1
3  Ramesh     59    male        29.5            1
4   Mohit     60    male        30.0            1
5  Sonali     61  female        30.5            0
6   Reena     62  female        31.0            0
7  Soniya     63  female        31.5            0

## Drop Column

In [48]:
df1.drop('male_female', axis=1)
df1.drop(['male_female','Half Marks'], axis=1)

    Names  Marks  Gender
0     Ram     56    male
1   Rohit     57    male
2  Suresh     58    male
3  Ramesh     59    male
4   Mohit     60    male
5  Sonali     61  female
6   Reena     62  female
7  Soniya     63  female

## Sort dataframe as per marks column

In [51]:
df1.sort_values(by='Marks')   #ascending order

    Names  Marks  Gender  Half Marks  male_female
0     Ram     56    male        28.0            1
1   Rohit     57    male        28.5            1
2  Suresh     58    male        29.0            1
3  Ramesh     59    male        29.5            1
4   Mohit     60    male        30.0            1
5  Sonali     61  female        30.5            0
6   Reena     62  female        31.0            0
7  Soniya     63  female        31.5            0

In [52]:
df1.sort_values(by='Marks',ascending = False)    #Descending order

    Names  Marks  Gender  Half Marks  male_female
7  Soniya     63  female        31.5            0
6   Reena     62  female        31.0            0
5  Sonali     61  female        30.5            0
4   Mohit     60    male        30.0            1
3  Ramesh     59    male        29.5            1
2  Suresh     58    male        29.0            1
1   Rohit     57    male        28.5            1
0     Ram     56    male        28.0            1

## Display name & marks of female student

In [57]:
df1[df1['Gender']=='female'][['Names',"Marks"]]
df1[df1['Gender'].isin(['female'])][['Names',"Marks"]]

    Names  Marks
5  Sonali     61
6   Reena     62
7  Soniya     63